create database     ãÏÑÓÉ;
	use    ãÏÑÓÉ ;
	   create table ØÇáÈ  (
			 ßæÏ_ÇáØÇáÈ int primary key  ,
			 ÇÓã_ÇáØÇáÈ char (20),
			 ÑŞã_Êáíİæä char (11),
			 ÇáÑŞã_ÇáŞæãì char (14),
			 ÚãÑ_ÇáØÇáÈ char (4),
		   );

insert into ØÇáÈ 
values (1 , 'ÇÍãÏ ãÍãæÏ','99976587845','75467433448','18');
insert into ØÇáÈ 
values (2 , 'Úáì ÇÈÑÇåíã','216878785','88767433448','17');
insert into ØÇáÈ 
values (3 , 'ãäÉ ÇÍãÏ','98765434345','75467987948','19');
insert into ØÇáÈ 
values (4 , 'ãÑíã ÕÈÑì','7767653345','89978878878','16');
insert into ØÇáÈ 
values (5 , 'ÎÇáÏ ãÍãæÏ','668769765','99886799999','15');
 
	create table ÇáãÚáã  (
				ßæÏ_ÇáãÚáã int primary key  ,
				ÇÓã_ÇáãÚáã char (20),
				Êáíİæä char (11),
				ÇáÑŞã_ÇáŞæãì char (14),
				ÚãÑ_ÇáãÚáã char (4),
			);

insert into ÇáãÚáã
values (1 , 'ãÍãÏ ÇáÏÓæŞì','99976587845','75467433448','34');
insert into ÇáãÚáã 
values (2 , 'Úáì ÇáãÓÑì ','216878785','88767433448','54');
insert into ÇáãÚáã 
values (3 , 'ãÑæÉ ÇáåæÇÑì','98765434345','75467987948','30');
insert into ÇáãÚáã 
values (4 , 'íÇÓãíä İæÏÇ','7767653345','89978878878','28');
insert into ÇáãÚáã 
values (5 , 'Úáì ÇáÚÑÈì','668769765','99886799999','44');
 

 
	create table ÇáãŞÑÑ  (
				ßæÏ_ÇáãŞÑÑ int primary key ,
				ÇÓã_ÇáãŞÑÑ varchar (50),
				ãÚáã_ÇáãŞÑÑ varchar (50),
				ÏÑÌÇÊ_ÇáãŞÑÑ char (4),
				ÊÑã_ÇáãŞÑÑ varchar (50),
			);

insert into ÇáãŞÑÑ
values (1 , 'ÇááÛÉ ÇáÚÑÈíÉ','Úáì ÇáÚÑÈì','100','ÊÑã Çæá');
insert into ÇáãŞÑÑ 
values (2 , 'ÇáÏÑÓÇÊ ÇáÇÌÊãÇÚíÉ','ãÑæÉ ÇáåæÇÑì','50','ÊÑã ÊÇäì ');
insert into ÇáãŞÑÑ 
values (3 , 'ÇááÛÉ ÇáÇäÌáíÒíÉ','ãÍãÏ ÇáÏÓæŞì','100','ÊÑã Çæá');
insert into ÇáãŞÑÑ 
values (4 , 'ÇáÚáæã','íÇÓãíä İæÏÇ','80','ÊÑã ÊÇäì');
insert into ÇáãŞÑÑ 
values (5 , 'ÇáÑíÇÖíÇÊ','Úáì ÇáãÓÑì','100','ÊÑã Çæá');
 
	update ØÇáÈ 
	set  ÚãÑ_ÇáØÇáÈ=ÚãÑ_ÇáØÇáÈ+1;

	select * 
	from ØÇáÈ ;

	select * 
	from ÇáãŞÑÑ;

	select * 
	from ÇáãÚáã ;